Catalogs/Палаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Палаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гендер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПалаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПалат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтационара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтационара</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыМинЗдрава</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ДвижениеКоечногоФонда.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДвижениеКоечногоФонда</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКоек</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Койка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Палаты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступностьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьКойкоМеста(Команда)
	
	Если РаботаСДиалогамиКлиент.ПроверитьМодифицированностьВФорме(ЭтаФорма) Тогда 
		Если Объект.КоличествоМест > 0 Тогда 
			СоздатьКойкоМестаНаСервере(Объект.Ссылка,Объект.КоличествоМест);
			Оповестить("СозданиеКоек");
			УстановитьДоступностьЭлементов();
		Иначе 
			Предупреждение("Укажите вместимость!");
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КоличествоМестПриИзменении(Элемент)
	
	КоличествоКойкоМестПарам = КоличествоКойкоМест(Объект.Ссылка);
	
	Если Объект.КоличествоМест < КоличествоКойкоМестПарам И КоличествоКойкоМестПарам <> 0 Тогда 
		Предупреждение("Указанная вместимость меньше количества созданных койко-мест");
		Объект.КоличествоМест = КоличествоКойкоМестПарам;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПрофильНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьФорму("Справочник.КлассификаторыМинЗдрава.ФормаВыбора", Новый Структура("Отбор, ВыборГруппИЭлементов", Новый Структура("ВидКлассификатора", ПредопределенноеЗначение("Перечисление.ВидыКлассификаторовМинЗдрава.НоменклатураКоечногоФондаМедицинскойОрганизации")), ИспользованиеГруппИЭлементов.ГруппыИЭлементы),ЭтотОбъект,,,,Новый ОписаниеОповещения("Профиль_ПослеВыбора", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

&НаСервереБезКонтекста
Функция КоличествоКойкоМест(Палата)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КойкоМеста.Ссылка) КАК КоличествоКойкоМест
	                      |ИЗ
	                      |	Справочник.КойкоМеста КАК КойкоМеста
	                      |ГДЕ
	                      |	КойкоМеста.Владелец = &Палата");
	Запрос.УстановитьПараметр("Палата",Палата);					  
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.КоличествоКойкоМест;
	Иначе 
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьДоступностьЭлементов()
	
	Если Объект.Ссылка.Пустая() Тогда 
		Элементы.СоздатьКойкоМеста.Доступность = Ложь;
	Иначе 
		Элементы.СоздатьКойкоМеста.Доступность = ?(КоличествоКойкоМест(Объект.Ссылка) = 0,Истина,Ложь);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьКойкоМестаНаСервере(Палата, КоличествоМест)
	
	МассивКоек = Новый Массив;
	
	Для инд = 1 По КоличествоМест Цикл 
		НовоеКойкоМесто = Справочники.КойкоМеста.СоздатьЭлемент();
		НовоеКойкоМесто.Наименование = СокрЛП(Палата.Префикс + " Койка №" + Строка(инд));
		НовоеКойкоМесто.Владелец = Палата;
		НовоеКойкоМесто.Записать();
		МассивКоек.Добавить(НовоеКойкоМесто.Ссылка);
	КонецЦикла;
	
	РегистрыСведений.ДвижениеКоечногоФонда.ВыполнитьДвижениеКоечногоФонда(МассивКоек, Палата,,,Истина);

КонецПроцедуры
		
&НаКлиенте
Процедура Профиль_ПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		Объект.Профиль = Результат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
